dmaone/CommonSense/MagValve.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Boot.h"
#include "BootPin_aliases.h"
#include "BootPin.h"
#include "BootIRQ.h"
#include "USB.h"
#include "USB_audio.h"
#include "USB_cdc.h"
#include "USB_hid.h"
#include "USB_midi.h"
#include "USB_pvt.h"
#include "USB_cydmac.h"
#include "USB_msc.h"
#include "DriveReg1.h"
#include "EEPROM.h"
#include "Rows1_aliases.h"
#include "DriveReg0.h"
#include "ColsR_aliases.h"
#include "SensorReg.h"
#include "VDAC3.h"
#include "TimerIRQ.h"
#include "SysTimer.h"
#include "ExpHdr_aliases.h"
#include "SuspendWD.h"
#include "USBSuspendIRQ.h"
#include "Cmp3.h"
#include "Sup_I2C.h"
#include "Sup_I2C_PVT.h"
#include "ILO_Trim.h"
#include "HPWR_aliases.h"
#include "HPWR.h"
#include "SetupDelay.h"
#include "ResetDelay.h"
#include "ResultIRQ.h"
#include "Cmp1.h"
#include "Cmp2.h"
#include "VDAC2.h"
#include "VDAC1.h"
#include "Cmp0.h"
#include "VDAC0.h"
#include "SensorStatus.h"
#include "ColsL_aliases.h"
#include "USB_VBUS_aliases.h"
#include "USB_VBUS.h"
#include "USB_Dm_aliases.h"
#include "USB_Dm.h"
#include "USB_Dp_aliases.h"
#include "USB_Dp.h"
#include "ILO_Trim_CorrectionISR.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

